ror/app/controllers/auth_controller.rb

  def login
    user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "alisajjad1272@gmail.com"], ["LIMIT", 1]]

  def test_create_user

    res = User.new(
      first_name: 'Test',
      last_name: 'User',
      display_name: 'Test User',
      email: 'alisajjad1272@gmail.com',
      password: 'test',
      password_confirmation: 'test',
    )

    abort res.save.inspect
---
INSERT INTO "users" ("first_name", "last_name", "display_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"