ror/app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "slug", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "Test"], ["slug", "test"], ["body", "test"], ["created_at", "2021-09-29 12:15:50.061106"], ["updated_at", "2021-09-29 12:15:50.061106"]]
---
  def create
    @post = Post.new(post_params)

    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def user_posts
    @posts = Post.where(user_id: params[:id])